# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

Include the relevant imports, then connect to the database located at `data.sqlite`.

In [1]:
# Your code here
import pandas as pd
import sqlite3

conn = sqlite3.connect('data.sqlite')

## Employees and Their Offices (a One-to-One Join)

Select all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [2]:
# Your code here
# Using employees (firstName, lastName) and offices (city, state) tables 
# Need to use a left join as we want to return employees even if they don't have an office
q = """
SELECT e.firstName, e.lastName, o.city, o.state
  FROM employees e
  LEFT JOIN offices AS o
     USING(officeCode)
 ORDER BY e.firstName, e.lastName
;
"""

df = pd.read_sql(q, conn)
print(f'Total number of reords {len(df)}')
df.head()

Total number of reords 23

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

## Customers and Their Orders (a One-to-Many Join)

Select all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [3]:
# Your code here
# Using customers (firstName, lastName) and orders tables (orderNumber, orderDate, status)

q = """
SELECT contactFirstName, contactLastName, orderNumber, orderDate, status
  FROM customers
  JOIN orders
     USING(customerNumber)
;
"""

df = pd.read_sql(q, conn)
df

    contactFirstName contactLastName  orderNumber   orderDate     status
0            Carine          Schmitt        10123  2003-05-20    Shipped
1            Carine          Schmitt        10298  2004-09-27    Shipped
2            Carine          Schmitt        10345  2004-11-25    Shipped
3               Jean            King        10124  2003-05-21    Shipped
4               Jean            King        10278  2004-08-06    Shipped
..               ...             ...          ...         ...        ...
321          Valarie          Franco        10243  2004-04-26    Shipped
322             Tony         Snowden        10138  2003-07-07    Shipped
323             Tony         Snowden        10179  2003-11-11  Cancelled
324             Tony         Snowden        10360  2004-12-16    Shipped
325             Tony         Snowden        10399  2005-04-01    Shipped

[326 rows x 5 columns]

## Customers and Their Payments (Another One-to-Many Join)

Select all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [4]:
# Your code here
# Using customers (contactFirstName, contactLastName, customerNumber)
# Using payments (paymentDate, amount)
q = """
SELECT contactFirstName, contactLastName, paymentDate, amount
  FROM customers c
  JOIN payments p
     ON c.customerNumber = p.customerNumber
 ORDER BY amount DESC
;
"""

df = pd.read_sql(q,conn)
print('There are {} records'.format(len(df)))
df.head()

There are 273 records

  contactFirstName contactLastName paymentDate     amount
0           Diego           Freyre  2005-03-18  120166.58
1           Diego           Freyre  2004-12-31  116208.40
2            Susan          Nelson  2003-08-15  111654.40
3             Eric       Natividad  2003-12-26  105743.00
4            Susan          Nelson  2005-03-05  101244.59

## Orders, Order Details, and Product Details (a Many-to-Many Join)

Select all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [6]:
# Your code here
# Using orders (orderDate), orderdetails (quantityOrdered), products (productName), and customers (contactLastName, contactFirstName)

a = """
SELECT c.contactFirstName, c.contactLastName, p.productName, od.quantityOrdered, o.orderDate
  FROM customers c
  JOIN orders o
     USING(customerNumber)
  JOIN orderdetails od
     USING(orderNumber)
  JOIN products p
     USING(productCode)
 ORDER BY orderDate DESC    
;
"""

df = pd.read_sql(a, conn)
print('Number of records:', len(df))
df.head()

Number of records: 2996

,contactFirstName,contactLastName,productName,quantityOrdered,orderDate
0,Janine,Labrune,1962 LanciaA Delta 16V,38,2005-05-31
1,Janine,Labrune,1957 Chevy Pickup,33,2005-05-31
2,Janine,Labrune,1998 Chrysler Plymouth Prowler,28,2005-05-31
3,Janine,Labrune,1964 Mercedes Tour Bus,38,2005-05-31
4,Janine,Labrune,1926 Ford Fire Engine,19,2005-05-31

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!